Revit 2024 API
WireConduitTypeSet.Contains Method
Tests for the existence of a conduit type within the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool Contains(
	WireConduitType item
)
Visual Basic
Public Overridable Function Contains ( _
	item As WireConduitType _
) As Boolean
Visual C++
public:
virtual bool Contains(
	WireConduitType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Electrical.WireConduitType
The conduit type to be searched for.
Return Value
The Contains method returns True if the conduit type is within the set, otherwise False.
See Also
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace